#+SETUPFILE: ../reveal.org
#+TITLE: Linear Mixed-Effects Models
#+PROPERTY: header-args:R :session *R* :exports both :results value

** Output

#+begin_src R :exports results :results output
  print(summary(mod), corr=FALSE)
#+end_src

#+RESULTS:
#+begin_example
Linear mixed model fit by maximum likelihood  ['lmerMod']
Formula: Reaction ~ Days + (Days | Subject)
   Data: sleepstudy

     AIC      BIC   logLik deviance df.resid 
  1763.9   1783.1   -876.0   1751.9      174 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-3.9416 -0.4656  0.0289  0.4636  5.1793 

Random effects:
 Groups   Name        Variance Std.Dev. Corr
 Subject  (Intercept) 565.48   23.780       
          Days         32.68    5.717   0.08
 Residual             654.95   25.592       
Number of obs: 180, groups:  Subject, 18

Fixed effects:
            Estimate Std. Error t value
(Intercept)  251.405      6.632  37.907
Days          10.467      1.502   6.968
#+end_example

** p-values: model comparison

- NB: use REML=FALSE!

#+begin_src R :exports both :results output
  mod1 <- lmer(Reaction ~ Days + (Days | Subject), 
	       sleepstudy, REML = FALSE)
  mod2 <- lmer(Reaction ~ (Days | Subject),
	       sleepstudy, REML = FALSE)
  
  anova(mod1, mod2)
#+end_src

#+RESULTS:
: Data: sleepstudy
: Models:
: mod2: Reaction ~ (Days | Subject)
: mod1: Reaction ~ Days + (Days | Subject)
:      Df    AIC    BIC  logLik deviance  Chisq Chi Df Pr(>Chisq)    
: mod2  5 1785.5 1801.4 -887.74   1775.5                             
: mod1  6 1763.9 1783.1 -875.97   1751.9 23.537      1  1.226e-06 ***
: ---
: Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

